{
  "{{clusterCount}} clusters depend on this group. Please update/remove the group from the clusters.": "{{clusterCount}} clusters dependem deste grupo. Atualize/remova o grupo dos clusters.",
  "{{serSubCount}} service subscription(s) depend on this channel. Please update/remove them before removing this channel.": "{{serSubCount}} assinaturas de serviço dependem deste canal. Atualize-as ou as remova antes de remover este canal.",
  "{{serSubCount}} service subscriptions depend on this channel version. Please have them updated/removed before removing this channel version.": "{{serSubCount}} assinaturas de serviço dependem da versão deste canal. Atualize-as ou remova-as antes de remover esta versão do canal.",
  "{{subCount}} other subscription(s) depend on this subscription's version. Please update/remove them before removing this subscription and version.": "Outras assinaturas de {{subCount}} dependem da versão desta assinatura. Atualize/remova-as antes de remover esta assinatura e versão.",
  "{{subCount}} subscription(s) depend on this configuration channel. Please update/remove them before removing this configuration channel.": "{{subCount}} assinaturas dependem deste canal de configuração. Atualize-as ou remova-as antes de remover este canal de configuração.",
  "{{subCount}} subscriptions depend on this cluster group. Please update/remove them before removing this group.": "{{subCount}} assinaturas dependem deste grupo de clusters. Atualize-as ou as remova antes de remover este grupo.",
  "{{subCount}} subscriptions depend on this configuration channel version. Please update/remove them before removing this configuration channel version.": "{{subCount}} assinaturas dependem desta versão do canal de configuração. Atualize-as ou remova-as antes de remover esta versão do canal de configuração.",
  "A cluster name is not defined in the registration data": "Não há um nome de cluster definido nos dados de registro",
  "Added subscription \"{{name}}\" must reference a valid version.": "A assinatura incluída \"{{name}}\" deve referenciar uma versão válida.",
  "Another cluster already exists with the same registration name {{registration.name}}": "Outro cluster já existe com o mesmo nome de registro {{registration.name}}",
  "Channel uuid \"{{channel_uuid}}\" not found.": "UUID do canal \"{{channel_uuid}}\" não localizado.",
  "Cluster with cluster_id \"{{clusterId}}\" not found": "O cluster com o cluster_id \"{{clusterId}}\" não foi localizado",
  "commonResourceSearch encountered an error. {{error.message}}": "commonResourceSearch encontrou um erro. {{error.message}}",
  "commonResourcesSearch encountered an error. {{error.message}}": "commonResourcesSearch encontrou um erro. {{error.message}}",
  "Could not find all the cluster groups {{groups}} in the groups database, please create them first.": "Não foi possível localizar todos os grupos de clusters {{groups}} no banco de dados de grupos. Crie-os primeiro.",
  "could not find group with name {{name}}.": "não foi possível localizar o grupo com o nome {{name}}.",
  "could not find group with uuid {{uuid}}.": "não foi possível localizar o grupo com o UUID {{uuid}}.",
  "Could not find subscriptions.": "Não foi possível localizar assinaturas.",
  "Could not find the cluster for the cluster id {{cluster_id}}.": "Não foi possível localizar o cluster para o ID de cluster {{cluster_id}}.",
  "Could not find the cluster with Id {{clusterId}}.": "Não foi possível localizar o cluster com o ID {{clusterId}}.",
  "Could not find the cluster with name {{clusterName}}.": "Não foi possível localizar o cluster com o nome {{clusterName}}.",
  "Could not find the configuration channel with name {{name}}.": "Não foi possível localizar o canal de configuração com o nome {{name}}.",
  "Could not find the configuration channel with uuid {{uuid}}.": "Não foi possível localizar o canal de configuração com o UUID {{uuid}}.",
  "Could not find the configuration channel with uuid/name {{channelUuid}}/channelName.": "Não foi possível localizar o canal de configuração com o UUID ou nome {{channelUuid}}/channelName.",
  "Could not find the organization key.": "Não foi possível localizar a chave da organização.",
  "Could not find the organization with ID {{org_id}}.": "Não foi possível localizar a organização com o ID {{org_id}}.",
  "Could not find the subscription for the subscription id {{subscription_id}}.": "Não foi possível localizar a assinatura para o ID de assinatura {{subscription_id}}.",
  "Could not find the subscription.": "Não foi possível localizar a assinatura.",
  "Could not locate the cluster with cluster_id {{cluster_id}}": "Não foi possível localizar o cluster com o cluster_id {{cluster_id}}",
  "Could not locate the cluster with clusterName {{clusterName}}": "Não foi possível localizar o cluster com o clusterName {{clusterName}}",
  "DeployableVersion is not found for {{channel.name}}:{{channel.uuid}}/{{versionObj.name}}:{{versionObj.uuid}}.": "Não foi localizada uma versão implementável para {{channel.name}}:{{channel.uuid}}/{{versionObj.name}}:{{versionObj.uuid}}.",
  "Failed to Publish resource notification, please reload the page.": "Falha ao publicar a notificação de recurso. Recarregue a página.",
  "Failed to Publish resource notification, pubsub is not ready yet, please retry later.": "Falha ao publicar a notificação de recurso. Pubsub ainda não está pronto. Tente novamente mais tarde.",
  "Failed to Publish subscription notification to clusters, please retry.": "Falha ao publicar a notificação de assinatura nos clusters. Tente novamente.",
  "Failed to Publish subscription notification to clusters, pubsub is not ready yet, please retry.": "Falha ao publicar a notificação de assinatura nos clusters. Pubsub ainda não está pronto. Tente novamente.",
  "group name \"{{name}}\" not found": "Nome do grupo \"{{name}}\" não localizado",
  "group uuid \"{{uuid}}\" not found": "UUID do grupo \"{{uuid}}\" não localizado",
  "hist _id \"{{histId}}\" not found": "hist_id \"{{histId}}\" não localizado",
  "Invalid razee-org-key was submitted for {{queryName}}": "Razee-org-key inválida enviada para {{queryName}}",
  "Maximum number of Organization Keys reached: {{number}}": "Número máximo de Chaves de organização atingido: {{number}}",
  "More than one {{type}} matches {{name}}": "Mais de um {{type}} corresponde ao {{name}}",
  "No changes specified.": "Nenhuma mudança especificada.",
  "No org was found for the org key.": "Nenhuma organização foi localizada para a chave de organização.",
  "No razee-org-key was supplied.": "Nenhuma razee-org-key foi fornecida.",
  "None of the passed group uuids were found": "Nenhum dos UUIDs do grupo aprovado foi localizado",
  "One or more of the passed group uuids were not found": "Um ou mais dos UUIDs do grupo aprovado não foram localizados",
  "org id was not found": "o ID da organização não foi localizado",
  "Organization key {{id}} cannot be altered, but it may be deleted.": "A chave da organização {{id}} não pode ser alterada, mas pode ser excluída.",
  "Organization key {{id}} cannot be removed or altered because it is in use by one or more clusters.": "A chave de organização {{id}} não pode ser removida ou alterada porque ela está em uso por um ou mais clusters.",
  "Organization key {{id}} cannot be removed or altered because it is in use for data encryption.  Create a new key and then wait a few minutes before retrying.": "A chave de organização {{id}} não pode ser removida ou alterada porque ela está em uso para criptografia de dados.  Crie uma nova chave e, em seguida, espere alguns minutos antes de tentar novamente.",
  "Organization key {{id}} cannot be removed or altered because it is in use for data encryption.  Data re-encryption is in progress, please try again in a few minutes.": "A chave de organização {{id}} não pode ser removida ou alterada porque ela está em uso para criptografia de dados.  A recriptografia de dados está em andamento; tente novamente em alguns minutos.",
  "Organization key {{id}} cannot be removed or altered because it is the last one.": "A chave de organização {{id}} não pode ser removida ou alterada porque é a última.",
  "Organization key {{id}} cannot be removed or altered because it is the only Primary key.": "A chave de organização {{id}} não pode ser removida ou alterada porque é a única chave primária.",
  "Provided YAML content is not valid: {{error}}": "O conteúdo do YAML fornecido não é válido: {{error}}",
  "Query {{queryName}} error. MessageID: {{req_id}}.": "Erro na consulta {{queryName}}. ID de mensagem: {{req_id}}.",
  "Query {{queryName}} find error. MessageID: {{req_id}}.": "Erro de localização na consulta {{queryName}}. ID de mensagem: {{req_id}}.",
  "Remote version source details must be provided.": "Detalhes da origem da versão remota devem ser fornecidos.",
  "resourcesCount encountered an error. {{error.message}}": "resourcesCount encontrou um erro. {{error.message}}",
  "Service subscription with ssid \"{{ssid}}\" not found.": "A assinatura de serviço com o ssid \"{{ssid}}\" não foi localizada",
  "Subscription { id: \"{{id}}\" } not found.": "A assinatura { ID: \"{{id}}\" } não foi localizada.",
  "Subscription { uuid: \"{{uuid}}\", org_id:{{org_id}} } not found.": "Assinatura { uuid: \"{{uuid}}\", org_id:{{org_id}} } não localizada.",
  "Subscription not found.": "Subscription not found.",
  "Subscription uuid \"{{uuid}}\" not found.": "UUID de assinatura \"{{uuid}}\" não localizado.",
  "The configuration channel name {{name}} already exists.": "O nome do canal de configuração {{name}} já existe.",
  "The content type {{contentType}} is not valid.  Allowed values: [{{contentTypes}}]": "O tipo de conteúdo {{contentType}} não é válido.  Valores permitidos: [{{contentTypes}}]",
  "The data location {{data_location}} is not valid.  Allowed values: [{{valid_locations}}]": "O data_location {{data_location}} não é válido.  Valores permitidos: [{{valid_locations}}]",
  "The group name {{name}} already exists.": "O nome do grupo {{name}} já existe.",
  "The provided name is already in use: {{name}}": "O nome fornecido já está em uso: {{name}}",
  "The remote type {{remoteType}} is not valid.  Allowed values: [{{remoteTypes}}]": "O tipo remoto {{remoteType}} não é válido.  Valores permitidos: [{{remoteTypes}}]",
  "The remote type cannot be changed.  Current value: [{{remoteType}}]": "O tipo remoto não pode ser alterado.  Valor atual: [{{remoteType}}]",
  "The remote version parameters are too large.  The string representation must be less than {{MAX_REMOTE_PARAMETERS_LENGTH}} characters long": "Os parâmetros de versão remota são muito grandes.  A representação em sequência deve ter menos que {{MAX_REMOTE_PARAMETERS_LENGTH}} caracteres de comprimento",
  "The version name \"{{name}}\" cannot be used more than once.": "O nome da versão \"{{name}}\" não pode ser usado mais de uma vez.",
  "Too many configuration channel versions are registered under {{channel_uuid}}.": "Muitas versões de canal de configuração estão registradas sob {{channel_uuid}}.",
  "Too many configuration channels are registered under {{org_id}}.": "Muitos canais de configuração estão registrados sob {{org_id}}.",
  "Too many subscriptions are registered under {{org_id}}.": "Muitas assinaturas estão registradas em {{org_id}}.",
  "Unsupported arguments: [{{args}}]": "Argumentos não suportados: [{{args}}]",
  "Unsupported mutation: {{args}}": "Unsupported mutation: {{args}}",
  "Uploaded versions must specify a \"file\" or \"content\".": "As versões transferidas por upload devem especificar um \"arquivo\" ou \"conteúdo\".",
  "Version uuid \"{{version_uuid}}\" not found.": "UUID da versão \"{{version_uuid}}\" não localizado.",
  "Versions must specify a \"name\".": "As versões devem especificar um \"nome\".",
  "Versions must specify a \"type\" of \"application/yaml\".": "As versões devem especificar um \"tipo\" de \"aplicativo/yaml\".",
  "YAML file size should not be more than {{CHANNEL_VERSION_YAML_MAX_SIZE_LIMIT_MB}}mb": "O arquivo YAML não deve ter um tamanho maior que {{CHANNEL_VERSION_YAML_MAX_SIZE_LIMIT_MB}} MB",
  "You are not allowed to {{action}} on {{type}} under organization {{org_id}} for the query {{queryName}}.": "Você não tem permissão para {{action}} em {{type}} na organização {{org_id}} para a consulta {{queryName}}.",
  "You are not allowed to access this resource due to missing cluster group permission.": "Você não tem a permissão de grupo de clusters necessária para acessar este recurso.",
  "You are not allowed to access this resource due to missing cluster tag permission.": "Você não tem a permissão de tag de cluster necessária para acessar este recurso.",
  "You are not allowed to read resources due to missing permissions on cluster group {{group.name}}.": "Você não tem as permissões necessárias no grupo de clusters {{group.name}} para ler recursos.",
  "You are not allowed to read resources due to missing permissions on subscription group {{group}}.": "Você não tem as permissões necessárias no grupo de assinaturas {{group}} para ler recursos.",
  "You are not allowed to read subscriptions due to missing permissions on cluster group {{group.name}}.": "Você não tem as permissões necessárias no grupo de clusters {{group.name}} para ler assinaturas.",
  "You are not allowed to set subscription for all of {{subscription.groups}} groups.": "Você não tem permissão para configurar a assinatura para todos os grupos {{subscription.groups}}.",
  "You have exceeded the maximum amount of clusters for this org - {{org_id}}": "Você excedeu a quantidade máxima de clusters para esta organização - {{org_id}}",
  "You have exeeded the maximum amount of pending clusters for this org - {{org_id}}.": "Você excedeu a quantidade máxima de clusters pendentes para esta organização - {{org_id}}."
}
